 org $8000  //Задаём начальный адресс программы 

 ldaa $8000 //Записываем в регистр А значение ячейки памяти $8000
 psha       //Сохраняем регистр А в стек

 ldaa $8001 //Записываем в регистр А значение ячейки памяти $8001
 psha       //Сохраняем регистр А в стек

 ldaa $8002 //Записываем в регистр А значение ячейки памяти $8002
 psha       //Сохраняем регистр А в стек

 ldaa $8003 //Записываем в регистр А значение ячейки памяти $8003
 psha       //Сохраняем регистр А в стек

 ldaa $8004 //Записываем в регистр А значение ячейки памяти $8004
 psha       //Сохраняем регистр А в стек

 ldaa $8005 //Записываем в регистр А значение ячейки памяти $8005
 psha       //Сохраняем регистр А в стек

 ldaa $8006 //Записываем в регистр А значение ячейки памяти $8006
 psha       //Сохраняем регистр А в стек

 ldaa $8007 //Записываем в регистр А значение ячейки памяти $8007
 psha       //Сохраняем регистр А в стек

 ldaa $8008 //Записываем в регистр А значение ячейки памяти $8008
 psha       //Сохраняем регистр А в стек

 ldaa $8009 //Записываем в регистр А значение ячейки памяти $8009
 psha       //Сохраняем регистр А в стек